Repository: mirtacn/facerecognition_django
Catalog: locale/*/LC_MESSAGES/django.po
Languages: id

source: Personal info
id: Info Pribadi

source: Permissions
id: Izin

source: Important dates
id: Tanggal Penting

source: Custom fields
id: Bidang Kustom

source: Education Level
id: Jenjang Pendidikan

source: Education Levels
id: Jenjang Pendidikan

source: Academic Year Name
id: Nama Tahun Akademik

source: Start Date
id: Tanggal Mulai

source: End Date
id: Tanggal Selesai

source: Active
id: Aktif

source: Inactive
id: Nonaktif

source: Active Status
id: Status Aktif

source: Academic Year
id: Tahun Akademik

source: Academic Years
id: Tahun Akademik

source: Semester Name
id: Nama Semester

source: Semesters
id: Semester

source: Student
id: Mahasiswa

source: Role
id: Peran

source: Account Status
id: Status Akun

source: Full Name
id: Nama Lengkap

source: Account
id: Akun

source: Accounts
id: Akun

source: Student ID
id: ID Mahasiswa

source: Class
id: Kelas

source: Total Credits Taken
id: Total SKS Diambil

source: Batch Year
id: Tahun Angkatan

source: Major
id: Jurusan

source: Students
id: Mahasiswa

source: Lecturer Name
id: Nama Dosen

source: Study Program
id: Program Studi

source: Lecturer
id: Dosen

source: Lecturers
id: Dosen

source: Supervisor 1
id: Pembimbing 1

source: Supervisor 2
id: Pembimbing 2

source: Supervisor 3
id: Pembimbing 3

source: Supervisor Type
id: Jenis Pembimbing

source: Student Lecturer
id: Mahasiswa Dosen

source: Student Lecturers
id: Mahasiswa Dosen

source: Activity Name
id: Nama Kegiatan

source: Credits
id: SKS

source: Total Hours per Week
id: Total Jam per Minggu

source: Target Hours
id: Target Jam

source: PA Activity
id: Kegiatan PA

source: PA Activities
id: Kegiatan PA

source: Credits Earned
id: SKS Diperoleh

source: Achieved Hours
id: Jam Tercapai

source: Not Fulfilled
id: Belum Terpenuhi

source: Fulfilled
id: Terpenuhi

source: Fulfillment Status
id: Status Pemenuhan

source: Credit Fulfillment Status
id: Status Pemenuhan SKS

source: Credit Fulfillment Statuses
id: Status Pemenuhan SKS

source: Attendance Date
id: Tanggal Presensi

source: Check-in Time
id: Waktu Check-in

source: Check-out Time
id: Waktu Check-out

source: Check-in Photo
id: Foto Check-in

source: Check-out Photo
id: Foto Check-out

source: Attendance
id: Presensi

source: Attendances
id: Presensi

source: Duration
id: Durasi

source: Attendance Duration
id: Durasi Presensi

source: Attendance Durations
id: Durasi Presensi

source: File Path
id: Lokasi File

source: Description
id: Deskripsi

source: Created At
id: Dibuat Pada

source: Face Photo
id: Foto Wajah

source: Face Photos
id: Foto Wajah

source: Pending
id: Menunggu

source: Approved
id: Disetujui

source: Rejected
id: Ditolak

source: Submission Status
id: Status Pengajuan

source: Rejection Reason
id: Alasan Penolakan

source: Updated At
id: Diperbarui Pada

source: Registration Submission
id: Pengajuan Pendaftaran

source: Registration Submissions
id: Pengajuan Pendaftaran

source: Admin Dashboard
id: Dashboard Admin

source: Today's Attendance
id: Presensi Hari Ini

source: From 45 students
id: Dari 45 mahasiswa

source: Average Attendance
id: Rata-rata Presensi

source: This week
id: Minggu ini

source: Odd 2025/2026
id: Ganjil 2025/2026

source: 8 weeks remaining
id: 8 minggu tersisa

source: Weekly Attendance per Program:
id: Presensi Mingguan per Program:

source: 12 present
id: 12 hadir

source: 16 present
id: 16 hadir

source: 8 present
id: 8 hadir

source: 14 present
id: 14 hadir

source: Monday
id: Senin

source: 17 present
id: 17 hadir

source: 9 present
id: 9 hadir

source: 13 present
id: 13 hadir

source: Tuesday
id: Selasa

source: 18 present
id: 18 hadir

source: 10 present
id: 10 hadir

source: Wednesday
id: Rabu

source: 15 present
id: 15 hadir

source: Thursday
id: Kamis

source: 11 present
id: 11 hadir

source: 7 present
id: 7 hadir

source: Friday
id: Jumat

source: This Week's Attendance Details:
id: Detail Presensi Minggu Ini:

source: Level
id: Jenjang

source: Present Count
id: Jumlah Hadir

source: Total Students
id: Total Mahasiswa

source: Percentage
id: Persentase

source: Recent Activity
id: Aktivitas Terkini

source: Real-time updates of student activities
id: Pembaruan real-time aktivitas mahasiswa

source: Student ID:
id: ID Mahasiswa:

source: Final Project D4 - Check-in
id: Proyek Akhir D4 - Check-in

source: Tridi Project 52 - Check-out
id: Proyek Tridi 52 - Check-out

source: Final Project 2 D4 - File upload
id: Proyek Akhir 2 D4 - Unggah file

source: Final Project 03 - Check-in
id: Proyek Akhir 03 - Check-in

source: Tridi Project 123 - Report submission
id: Proyek Tridi 123 - Pengumpulan laporan

source: Quick Actions:
id: Aksi Cepat:

source: Registration Approval
id: Persetujuan Pendaftaran

source: Student Data
id: Data Mahasiswa

source: Duration Monitor
id: Monitor Durasi

source: Attendance Camera
id: Kamera Presensi

source: Attendance Details -
id: Detail Presensi -

source: Student Account Registration Approval
id: Persetujuan Pendaftaran Akun Mahasiswa

source: Total Registrations
id: Total Pendaftaran

source: Waiting Approval
id: Menunggu Persetujuan

source: Search by name, student ID, or email...
id: Cari berdasarkan nama, ID mahasiswa, atau email...

source: List of Student Account Submissions:
id: Daftar Pengajuan Akun Mahasiswa:

source: registrations found
id: pendaftaran ditemukan

source: Submission Date
id: Tanggal Pengajuan

source: Approval/Rejection Date
id: Tanggal Persetujuan/Penolakan

source: Student Name
id: Nama Mahasiswa

source: Action
id: Aksi

source: Photo
id: Foto

source: Not filled
id: Tidak diisi

source: Approve
id: Setujui

source: Reject
id: Tolak

source: Download Photos
id: Unduh Foto

source: No registration data
id: Tidak ada data pendaftaran

source: Try with different keywords
id: Coba dengan kata kunci lain

source: Student Registration Detail
id: Detail Pendaftaran Mahasiswa

source: Loading
id: Memuat

source: Approval Confirmation
id: Konfirmasi Persetujuan

source: Cancel
id: Batal

source: Yes, Approve
id: Ya, Setujui

source: Rejection Confirmation
id: Konfirmasi Penolakan

source: Reject Registration
id: Tolak Pendaftaran

source: Failed to load data. Please try again.
id: Gagal memuat data. Silakan coba lagi.

source: Processing
id: Memproses

source: Registration successfully approved!
id: Pendaftaran berhasil disetujui!

source: An error occurred
id: Terjadi kesalahan

source: Network error occurred
id: Terjadi kesalahan jaringan

source: Rejection reason must be filled
id: Alasan penolakan harus diisi

source: Registration successfully rejected!
id: Pendaftaran berhasil ditolak!

source: Photo download started successfully
id: Unduh foto berhasil dimulai

source: Search Student
id: Cari Mahasiswa

source: Search by name, ID, email, major, or class...
id: Cari berdasarkan nama, ID, email, jurusan, atau kelas...

source: Filter by Level
id: Filter berdasarkan Jenjang

source: All Levels
id: Semua Jenjang

source: Student List
id: Daftar Mahasiswa

source: students found
id: mahasiswa ditemukan

source: Credit Activities
id: Kegiatan SKS

source: more
id: lainnya

source: No activities yet
id: Belum ada kegiatan

source: Delete
id: Hapus

source: No student data found
id: Tidak ada data mahasiswa ditemukan

source: Try with other filters or keywords
id: Coba dengan filter atau kata kunci lain

source: Edit Student Data
id: Edit Data Mahasiswa

source: Confirm Delete
id: Konfirmasi Hapus

source: Delete Student Data?
id: Hapus Data Mahasiswa?

source: Are you sure you want to delete this student's data?
id: Apakah Anda yakin ingin menghapus data mahasiswa ini?

source: Deleted data cannot be recovered.
id: Data yang dihapus tidak dapat dipulihkan.

source: Yes, Delete Data
id: Ya, Hapus Data

source: Deleting...
id: Menghapus...

source: Student data successfully deleted!
id: Data mahasiswa berhasil dihapus!

source: Network response was not ok
id: Respons jaringan tidak baik

source: PA Credit Data
id: Data SKS PA

source: Academic Year Settings
id: Pengaturan Tahun Akademik

source: Search by activity name...
id: Cari berdasarkan nama kegiatan...

source: Add PA Course
id: Tambah Mata Kuliah PA

source: Course
id: Mata Kuliah

source: Hours/Week
id: Jam/Minggu

source: Total Hours
id: Total Jam

source: Academic Year:
id: Tahun Akademik:

source: hours
id: jam

source: No activity data yet
id: Belum ada data kegiatan

source: Add new activity with the button above
id: Tambahkan kegiatan baru dengan tombol di atas

source: Search by semester name or academic year...
id: Cari berdasarkan nama semester atau tahun akademik...

source: Add Academic Year
id: Tambah Tahun Akademik

source: Name
id: Nama

source: Activate
id: Aktifkan

source: No semester data yet
id: Belum ada data semester

source: Add new semester with the button above
id: Tambahkan semester baru dengan tombol di atas

source: Add Credit Activity
id: Tambah Kegiatan SKS

source: Select Level
id: Pilih Jenjang

source: Number of Credits
id: Jumlah SKS

source: Save
id: Simpan

source: Edit Credit Activity
id: Edit Kegiatan SKS

source: Save Changes
id: Simpan Perubahan

source: Delete Confirmation
id: Konfirmasi Hapus

source: Are you sure you want to delete activity
id: Apakah Anda yakin ingin menghapus kegiatan

source: Example: Odd 2024/2025
id: Contoh: Ganjil 2024/2025

source: Are you sure you want to delete academic year
id: Apakah Anda yakin ingin menghapus tahun akademik

source: Failed to load activity data
id: Gagal memuat data kegiatan

source: An error occurred while loading data
id: Terjadi kesalahan saat memuat data

source: Failed to load semester data
id: Gagal memuat data semester

source: Are you sure you want to activate academic year
id: Apakah Anda yakin ingin mengaktifkan tahun akademik

source: Academic year successfully activated
id: Tahun akademik berhasil diaktifkan

source: Student Attendance Camera
id: Kamera Presensi Mahasiswa

source: Student Attendance List
id: Daftar Presensi Mahasiswa

source: students
id: mahasiswa

source: Date
id: Tanggal

source: Check-in Image
id: Gambar Check-in

source: Check-out Image
id: Gambar Check-out

source: No approved students yet
id: Belum ada mahasiswa yang disetujui

source: All students whose registration approval status has been approved will appear here
id: Semua mahasiswa yang status persetujuan pendaftarannya telah disetujui akan muncul di sini

source: Go to Registration Approval
id: Pergi ke Persetujuan Pendaftaran

source: Only displays students whose registration approval status has been APPROVED. Multiple check-ins/outs per day are allowed, must check-out before checking in again. Data is reset every new day.
id: Hanya menampilkan mahasiswa yang status persetujuan pendaftarannya telah DISETUJUI. Beberapa check-in/out per hari diperbolehkan, harus check-out sebelum check-in kembali. Data direset setiap hari baru.

source: Take Attendance Photo
id: Ambil Foto Presensi

source: Live Camera
id: Kamera Langsung

source: Make sure your face is clearly visible
id: Pastikan wajah Anda terlihat jelas

source: Take Photo
id: Ambil Foto

source: Retake
id: Ambil Ulang

source: Preview
id: Pratinjau

source: Photo will appear here
id: Foto akan muncul di sini

source: Photo will be saved as attendance evidence
id: Foto akan disimpan sebagai bukti presensi

source: Confirm & Save
id: Konfirmasi & Simpan

source: Cannot access camera. Please ensure camera permission is granted.
id: Tidak dapat mengakses kamera. Pastikan izin kamera diberikan.

source: Action: CHECK-IN
id: Aksi: CHECK-IN

source: Action: CHECK-OUT
id: Aksi: CHECK-OUT

source: No photo taken!
id: Tidak ada foto yang diambil!

source: Processing...
id: Memproses...

source: CHECK-IN/OUT successful for
id: CHECK-IN/OUT berhasil untuk

source: Failed:
id: Gagal:

source: An error occurred while processing:
id: Terjadi kesalahan saat memproses:

source: Student Face Data Master
id: Master Data Wajah Mahasiswa

source: Total Photos Stored
id: Total Foto Tersimpan

source: Average Photos/Student
id: Rata-rata Foto/Mahasiswa

source: Search by name, student ID, or program...
id: Cari berdasarkan nama, ID mahasiswa, atau program...

source: List of Student Face Data:
id: Daftar Data Wajah Mahasiswa:

source: data found
id: data ditemukan

source: Profile Photo
id: Foto Profil

source: Number of Photos
id: Jumlah Foto

source: Photos
id: Foto

source: No student data
id: Tidak ada data mahasiswa

source: Student Face Data Detail
id: Detail Data Wajah Mahasiswa

source: Loading data
id: Memuat data

source: Level/Semester
id: Jenjang/Semester

source: Registration Date
id: Tanggal Pendaftaran

source: Total Photos
id: Total Foto

source: Download All Photos
id: Unduh Semua Foto

source: Face Photo Gallery
id: Galeri Foto Wajah

source: photos
id: foto

source: No photos stored yet
id: Belum ada foto yang disimpan

source: This student has not uploaded any face photos
id: Mahasiswa ini belum mengunggah foto wajah

source: No data
id: Tidak ada data

source: Registration photo
id: Foto pendaftaran

source: Are you sure you want to approve this registration?
id: Apakah Anda yakin ingin menyetujui pendaftaran ini?

source: The student will get access to the system after approval.
id: Mahasiswa akan mendapatkan akses ke sistem setelah persetujuan.

source: Download ZIP
id: Unduh ZIP

source: No face photos uploaded
id: Tidak ada foto wajah yang diunggah

source: Student Information
id: Informasi Mahasiswa

source: Personal Data
id: Data Pribadi

source: Academic Data
id: Data Akademik

source: Year of Entry
id: Tahun Masuk

source: Major/Study Program
id: Jurusan/Program Studi

source: Supervising Lecturers
id: Dosen Pembimbing

source: Laboratory Courses
id: Mata Kuliah Laboratorium

source: Photo download successfully started
id: Unduh foto berhasil dimulai

source: Unique Registration Number
id: Nomor Registrasi Unik

source: Select Semester
id: Pilih Semester

source: Select Activities
id: Pilih Kegiatan

source: Saving...
id: Menyimpan...

source: Student data successfully updated!
id: Data mahasiswa berhasil diperbarui!

source: Provide the reason for rejecting this registration
id: Berikan alasan untuk menolak pendaftaran ini

source: Registration will be rejected:
id: Pendaftaran akan ditolak:

source: Enter the reason for rejection (example: Unclear photo, Invalid data, etc.)
id: Masukkan alasan penolakan (contoh: Foto tidak jelas, Data tidak valid, dll.)

source: The rejection reason will be sent to the student's email.
id: Alasan penolakan akan dikirim ke email mahasiswa.

source: Attendance Recap
id: Rekap Presensi

source: Report Filter
id: Filter Laporan

source: Activity
id: Kegiatan

source: Apply Filter
id: Terapkan Filter

source: Attendance Data
id: Data Presensi

source: Final Project Activity
id: Kegiatan Proyek Akhir

source: Not Checked-out Yet
id: Belum Check-out

source: No attendance data found
id: Tidak ada data presensi ditemukan

source: No attendance data
id: Tidak ada data presensi

source: No attendance data found for the selected filter.
id: Tidak ada data presensi ditemukan untuk filter yang dipilih.

source: Try changing the filter or date range.
id: Coba ubah filter atau rentang tanggal.

source: Attendance & Credit Management System
id: Sistem Manajemen Presensi & SKS

source: Dashboard
id: Dasbor

source: Logout
id: Keluar

source: TOTAL STUDENTS
id: TOTAL MAHASISWA

source: TOTAL CREDITS
id: TOTAL SKS

source: FULFILLED STATUS
id: STATUS TERPENUHI

source: NOT FULFILLED
id: BELUM TERPENUHI

source: Search by name, ID, or class...
id: Cari berdasarkan nama, ID, atau kelas...

source: Filter Education Level
id: Filter Jenjang Pendidikan

source: Export Excel
id: Ekspor Excel

source: Print PDF
id: Cetak PDF

source: Hours/Semester
id: Jam/Semester

source: Progress
id: Progres

source: Hours
id: Jam

source: No data for students with approved status
id: Tidak ada data untuk mahasiswa dengan status disetujui

source: No students have been approved yet
id: Belum ada mahasiswa yang disetujui

source: Show only not fulfilled
id: Tampilkan hanya yang belum terpenuhi

source: not fulfilled
id: belum terpenuhi

source: Excel export feature will be implemented
id: Fitur ekspor Excel akan diimplementasikan

source: Attendance & SKS Management System - Face Recognition
id: Sistem Manajemen Presensi & SKS - Pengenalan Wajah

source: Student Dashboard
id: Dasbor Mahasiswa

source: Login - Attendance & Credit Management System
id: Login - Sistem Manajemen Presensi & SKS

source: Attendance & Credit Management System PA Lab MSECT
id: Sistem Manajemen Presensi & SKS PA Lab MSECT

source: Face Recognition
id: Pengenalan Wajah

source: Integrated system for attendance management, credit assessment, and final project student progress monitoring.
id: Sistem terintegrasi untuk manajemen presensi, penilaian SKS, dan monitoring progres mahasiswa proyek akhir.

source: Attendance using Face Recognition
id: Presensi menggunakan Pengenalan Wajah

source: Credit Progress Monitoring
id: Monitoring Progres SKS

source: Final Project Activity Management
id: Manajemen Kegiatan Proyek Akhir

source: Encrypted & secure system
id: Sistem terenkripsi & aman

source: Welcome!
id: Selamat Datang!

source: Please login to access your account
id: Silakan login untuk mengakses akun Anda

source: Enter NRP
id: Masukkan NRP

source: Password
id: Kata Sandi

source: Enter password
id: Masukkan kata sandi

source: Don't have an account?
id: Belum punya akun?

source: Register new account
id: Daftar akun baru

source: Face Data
id: Data Wajah

source: Minimum
id: Minimal

source: Account Approval - In Process
id: Persetujuan Akun - Dalam Proses

source: Your Account Approval is in Process
id: Persetujuan Akun Anda Sedang Diproses

source: Status: Awaiting Admin Verification
id: Status: Menunggu Verifikasi Admin

source: Your account has been registered!
id: Akun Anda telah terdaftar!

source: Verification Process
id: Proses Verifikasi

source: We are verifying your academic data and validating your face photos.
id: Kami sedang memverifikasi data akademik Anda dan memvalidasi foto wajah Anda.

source: Please wait up to 324 hours
id: Silakan tunggu hingga 324 jam

source: You will receive an email notification after approval.
id: Anda akan menerima notifikasi email setelah persetujuan.

source: Please check your email periodically for account status updates.
id: Silakan periksa email Anda secara berkala untuk pembaruan status akun.

source: Notification will be sent to:
id: Notifikasi akan dikirim ke:

source: Back to Login Page
id: Kembali ke Halaman Login

source: If you don't receive an email within 24 hours, contact
id: Jika Anda tidak menerima email dalam 24 jam, hubungi

source: Student Profile
id: Profil Mahasiswa

source: Personal Information
id: Informasi Pribadi

source: Edit Profile
id: Edit Profil

source: No PA activities yet
id: Belum ada kegiatan PA

source: Supervisors
id: Pembimbing

source: Edit Supervisors
id: Edit Pembimbing

source: Supervisor data is not available yet.
id: Data pembimbing belum tersedia.

source: Edit Student Profile
id: Edit Profil Mahasiswa

source: Student ID cannot be changed
id: ID Mahasiswa tidak dapat diubah

source: Selected PA Activities
id: Kegiatan PA Terpilih

source: Loading PA activities...
id: Memuat kegiatan PA...

source: Select education level first
id: Pilih jenjang pendidikan terlebih dahulu

source: Change Password
id: Ubah Kata Sandi

source: New Password
id: Kata Sandi Baru

source: Enter new password
id: Masukkan kata sandi baru

source: Confirm Password
id: Konfirmasi Kata Sandi

source: Confirm new password
id: Konfirmasi kata sandi baru

source: Supervisor 1 *
id: Pembimbing 1 *

source: Select Supervisor
id: Pilih Pembimbing

source: Supervisor 2 *
id: Pembimbing 2 *

source: Supervisor 3 (Optional)
id: Pembimbing 3 (Opsional)

source: Select Supervisor (Optional)
id: Pilih Pembimbing (Opsional)

source: No PA activities for this level
id: Tidak ada kegiatan PA untuk jenjang ini

source: Failed to load PA activities. Please refresh the page.
id: Gagal memuat kegiatan PA. Silakan segarkan halaman.

source: Please fill in password and confirm password!
id: Silakan isi kata sandi dan konfirmasi kata sandi!

source: Password and confirmation do not match!
id: Kata sandi dan konfirmasi tidak cocok!

source: Please select at least one PA activity!
id: Silakan pilih setidaknya satu kegiatan PA!

source: Profile updated successfully!
id: Profil berhasil diperbarui!

source: Failed to update profile!
id: Gagal memperbarui profil!

source: An error occurred while saving:
id: Terjadi kesalahan saat menyimpan:

source: Supervisor 1 and 2 are required!
id: Pembimbing 1 dan 2 wajib diisi!

source: Supervisor 1 and 2 cannot be the same!
id: Pembimbing 1 dan 2 tidak boleh sama!

source: Supervisors updated successfully!
id: Pembimbing berhasil diperbarui!

source: Failed to update supervisors!
id: Gagal memperbarui pembimbing!

source: Credit Progress
id: Progres SKS

source: This Semester's Credit Progress
id: Progres SKS Semester Ini

source: Total Credits
id: Total SKS

source: Overall Semester Progress
id: Progres Semester Keseluruhan

source: Completed Hours
id: Jam Terselesaikan

source: Remaining Hours
id: Jam Tersisa

source: Credit Progress Details
id: Detail Progres SKS

source: Amount
id: Jumlah

source: From 344 target hours
id: Dari 344 jam target

source: To reach target
id: Untuk mencapai target

source: In Progress
id: Dalam Proses

source: Total Target Hours
id: Total Jam Target

source: This semester's target
id: Target semester ini

source: Progress Status
id: Status Progres

source: Excellent
id: Sangat Baik

source: Export Report
id: Ekspor Laporan

source: Completion Estimate
id: Perkiraan Penyelesaian

source: Average per Week
id: Rata-rata per Minggu

source: Estimated Completion
id: Perkiraan Penyelesaian

source: Time Remaining
id: Waktu Tersisa

source: days
id: hari

source: Recommendation/hour
id: Rekomendasi/jam

source: hours/day
id: jam/hari

source: Preparing credit progress report...
id: Mempersiapkan laporan progres SKS...

source: CREDIT PROGRESS REPORT
id: LAPORAN PROGRES SKS

source: Recommendation
id: Rekomendasi

source: hours per day
id: jam per hari

source: Progress report successfully downloaded
id: Laporan progres berhasil diunduh

source: Progress bar animation started...
id: Animasi progress bar dimulai...

source: Registration - Step 1
id: Pendaftaran - Langkah 1

source: Student Account Registration
id: Pendaftaran Akun Mahasiswa

source: Attendance & Credit Management System - Face Recognition
id: Sistem Manajemen Presensi & SKS - Pengenalan Wajah

source: Step 1 of 3
id: Langkah 1 dari 3

source: Academic
id: Akademik

source: Account & Identity Data
id: Data Akun & Identitas

source: Please enter your login account data and basic identity information.
id: Silakan masukkan data akun login Anda dan informasi identitas dasar.

source: Student ID Number (NRP)
id: Nomor ID Mahasiswa (NRP)

source: Example: 2345678901 (10-12 digits)
id: Contoh: 2345678901 (10-12 digit)

source: Department
id: Jurusan

source: Admission Year
id: Tahun Masuk

source: Select your year of admission
id: Pilih tahun masuk Anda

source: Minimum 8 characters, combination of letters and numbers
id: Minimal 8 karakter, kombinasi huruf dan angka

source: Continue to Academic Data
id: Lanjut ke Data Akademik

source: Select Class
id: Pilih Kelas

source: Select Department First
id: Pilih Jurusan Terlebih Dahulu

source: Select Admission Year (e.g.:
id: Pilih Tahun Masuk (contoh:

source: Please complete all required data before continuing.
id: Silakan lengkapi semua data yang diperlukan sebelum melanjutkan.

source: Registration - Academic Data
id: Pendaftaran - Data Akademik

source: Step 2 of 3
id: Langkah 2 dari 3

source: Academic Data & Final Project Activities
id: Data Akademik & Kegiatan Proyek Akhir
