Repository: mirtacn/facerecognition_django
Catalog: locale/*/LC_MESSAGES/django.po
Languages: id

source: Select activities and determine your academic advisors.
id: Pilih kegiatan dan tentukan pembimbing akademik Anda.

source: Validation Error
id: Error Validasi

source: Current Semester
id: Semester Saat Ini

source: Final Project Activities
id: Kegiatan Proyek Akhir

source: Check all activities you are currently participating in for final project credit fulfillment
id: Centang semua kegiatan yang sedang Anda ikuti untuk pemenuhan SKS proyek akhir

source: Credit Details and Target Hours
id: Detail SKS dan Target Jam

source: activities selected
id: kegiatan terpilih

source: Academic Advisors
id: Pembimbing Akademik

source: Select two mandatory advisors and one optional advisor.
id: Pilih dua pembimbing wajib dan satu pembimbing opsional.

source: Advisor 1 (Mandatory)
id: Pembimbing 1 (Wajib)

source: Advisor 2 (Mandatory)
id: Pembimbing 2 (Wajib)

source: Advisor 3 (Optional)
id: Pembimbing 3 (Opsional)

source: Back
id: Kembali

source: Continue to Upload Photos
id: Lanjut ke Unggah Foto

source: No activities available for this level
id: Tidak ada kegiatan tersedia untuk jenjang ini

source: Error loading activity data
id: Error memuat data kegiatan

source: Registration - Upload Photos
id: Pendaftaran - Unggah Foto

source: Step 3 of 3
id: Langkah 3 dari 3

source: Upload Face Photos
id: Unggah Foto Wajah

source: Upload face photos for face recognition attendance system
id: Unggah foto wajah untuk sistem presensi pengenalan wajah

source: Photo Quality Guidelines
id: Panduan Kualitas Foto

source: Plain background (preferably white/gray)
id: Latar belakang polos (sebaiknya putih/abu-abu)

source: Good lighting, face clearly visible
id: Pencahayaan baik, wajah terlihat jelas

source: No sunglasses, hats, or masks
id: Tidak menggunakan kacamata hitam, topi, atau masker

source: Upload at least 10 photos with different angles and expressions
id: Unggah minimal 10 foto dengan sudut dan ekspresi berbeda

source: Format: JPG, PNG, maximum 5MB per file
id: Format: JPG, PNG, maksimal 5MB per file

source: Click to upload photos or drag & drop
id: Klik untuk mengunggah foto atau tarik & lepas

source: Max. 5MB per file
id: Maks. 5MB per file

source: of 10 photos uploaded
id: dari 10 foto terunggah

source: Important Note
id: Catatan Penting

source: The system requires at least 10 photos with different angles and expressions for the best accuracy in face recognition.
id: Sistem membutuhkan minimal 10 foto dengan sudut dan ekspresi berbeda untuk akurasi terbaik dalam pengenalan wajah.

source: Submit Data & Request Approval
id: Kirim Data & Minta Persetujuan

source: Already have an account?
id: Sudah punya akun?

source: Login here
id: Login di sini

source: File
id: Berkas

source: is not an image. Only JPG, PNG are allowed.
id: bukan gambar. Hanya JPG, PNG yang diizinkan.

source: is too large. Maximum 5MB.
id: terlalu besar. Maksimal 5MB.

source: photos required. You have only uploaded
id: foto diperlukan. Anda hanya mengunggah

source: photos.
id: foto.

source: Sending...
id: Mengirim...

source: Attendance History
id: Riwayat Presensi

source: Odd Semester
id: Semester Ganjil

source: Even Semester
id: Semester Genap

source: Show All
id: Tampilkan Semua

source: This Semester's Credit Activities
id: Kegiatan SKS Semester Ini

source: Present
id: Hadir

source: Late
id: Terlambat

source: Permission
id: Izin

source: Sick
id: Sakit

source: Absent
id: Absen

source: No attendance data available
id: Tidak ada data presensi tersedia

source: Showing
id: Menampilkan

source: attendance data for
id: data presensi untuk

source: Showing all attendance data
id: Menampilkan semua data presensi

source: Preparing Excel file...
id: Mempersiapkan file Excel...

source: Excel file successfully downloaded
id: File Excel berhasil diunduh

source: Indonesian
id: Bahasa Indonesia

source: English
id: Bahasa Inggris

source: Messages
id: Pesan

source: Site Maps
id: Peta Situs

source: Static Files
id: File Statis

source: Syndication
id: Sindikasi

source: That page number is not an integer
id: Nomor halaman tersebut bukan bilangan bulat

source: That page number is less than 1
id: Nomor halaman tersebut kurang dari 1

source: That page contains no results
id: Halaman tersebut tidak berisi hasil

source: Enter a valid value.
id: Masukkan nilai yang valid.

source: Enter a valid domain name.
id: Masukkan nama domain yang valid.

source: Enter a valid URL.
id: Masukkan URL yang valid.

source: Enter a valid integer.
id: Masukkan bilangan bulat yang valid.

source: Enter a valid email address.
id: Masukkan alamat email yang valid.

source: Enter a valid %(protocol)s address.
id: Masukkan alamat %(protocol)s yang valid.

source: IPv4 or IPv6
id: IPv4 atau IPv6

source: Enter only digits separated by commas.
id: Masukkan hanya angka yang dipisahkan dengan koma.

source: Ensure this value is %(limit_value)s (it is %(show_value)s).
id: Pastikan nilai ini adalah %(limit_value)s (saat ini %(show_value)s).

source: Ensure this value is less than or equal to %(limit_value)s.
id: Pastikan nilai ini kurang dari atau sama dengan %(limit_value)s.

source: Ensure this value is greater than or equal to %(limit_value)s.
id: Pastikan nilai ini lebih besar dari atau sama dengan %(limit_value)s.

source: Ensure this value is a multiple of step size %(limit_value)s.
id: Pastikan nilai ini adalah kelipatan dari ukuran langkah %(limit_value)s.

source: Ensure this value is a multiple of step size %(limit_value)s, starting from %(offset)s, e.g. %(offset)s, %(valid_value1)s, %(valid_value2)s, and so on.
id: Pastikan nilai ini adalah kelipatan dari ukuran langkah %(limit_value)s, dimulai dari %(offset)s, misalnya %(offset)s, %(valid_value1)s, %(valid_value2)s, dan seterusnya.

source: Ensure this value has at least %(limit_value)d character (it has %(show_value)d).
id: Pastikan nilai ini memiliki setidaknya %(limit_value)d karakter (saat ini %(show_value)d).

source: Ensure this value has at most %(limit_value)d character (it has %(show_value)d).
id: Pastikan nilai ini memiliki paling banyak %(limit_value)d karakter (saat ini %(show_value)d).

source: Enter a number.
id: Masukkan angka.

source: Ensure that there are no more than %(max)s digit in total.
id: Pastikan tidak ada lebih dari %(max)s digit secara total.

source: Ensure that there are no more than %(max)s decimal place.
id: Pastikan tidak ada lebih dari %(max)s tempat desimal.

source: Ensure that there are no more than %(max)s digit before the decimal point.
id: Pastikan tidak ada lebih dari %(max)s digit sebelum titik desimal.

source: Null characters are not allowed.
id: Karakter null tidak diizinkan.

source: and
id: dan

source: %(model_name)s with this %(field_labels)s already exists.
id: %(model_name)s dengan %(field_labels)s ini sudah ada.

source: Value %(value)r is not a valid choice.
id: Nilai %(value)r bukan pilihan yang valid.

source: This field cannot be null.
id: Bidang ini tidak boleh null.

source: This field cannot be blank.
id: Bidang ini tidak boleh kosong.

source: %(model_name)s with this %(field_label)s already exists.
id: %(model_name)s dengan %(field_label)s ini sudah ada.

source: %(field_label)s must be unique for %(date_field_label)s %(lookup_type)s.
id: %(field_label)s harus unik untuk %(date_field_label)s %(lookup_type)s.

source: Field of type: %(field_type)s
id: Bidang bertipe: %(field_type)s

source: Boolean (Either True or False)
id: Boolean (True atau False)

source: String (up to %(max_length)s)
id: String (hingga %(max_length)s)

source: String (unlimited)
id: String (tak terbatas)

source: Comma-separated integers
id: Bilangan bulat yang dipisahkan koma

source: Date (without time)
id: Tanggal (tanpa waktu)

source: Date (with time)
id: Tanggal (dengan waktu)

source: Decimal number
id: Angka desimal

source: Email address
id: Alamat email

source: File path
id: Lokasi file

source: Floating point number
id: Bilangan floating point

source: Integer
id: Bilangan bulat

source: Big (8 byte) integer
id: Bilangan bulat besar (8 byte)

source: Small integer
id: Bilangan bulat kecil

source: IPv4 address
id: Alamat IPv4

source: IP address
id: Alamat IP

source: Boolean (Either True, False or None)
id: Boolean (True, False, atau None)

source: Positive big integer
id: Bilangan bulat besar positif

source: Positive integer
id: Bilangan bulat positif

source: Positive small integer
id: Bilangan bulat kecil positif

source: Slug (up to %(max_length)s)
id: Slug (hingga %(max_length)s)

source: Text
id: Teks

source: Time
id: Waktu

source: Raw binary data
id: Data biner mentah

source: Universally unique identifier
id: Pengenal unik universal

source: Image
id: Gambar

source: A JSON object
id: Objek JSON

source: Value must be valid JSON.
id: Nilai harus berupa JSON yang valid.

source: %(model)s instance with %(field)s %(value)r is not a valid choice.
id: Instansi %(model)s dengan %(field)s %(value)r bukan pilihan yang valid.

source: Foreign Key (type determined by related field)
id: Kunci Asing (tipe ditentukan oleh bidang terkait)

source: One-to-one relationship
id: Hubungan satu-ke-satu

source: %(from)s-%(to)s relationship
id: Hubungan %(from)s-%(to)s

source: %(from)s-%(to)s relationships
id: Hubungan %(from)s-%(to)s

source: Many-to-many relationship
id: Hubungan banyak-ke-banyak

source: This field is required.
id: Bidang ini wajib diisi.

source: Enter a whole number.
id: Masukkan bilangan bulat.

source: Enter a valid date.
id: Masukkan tanggal yang valid.

source: Enter a valid time.
id: Masukkan waktu yang valid.

source: Enter a valid date/time.
id: Masukkan tanggal/waktu yang valid.

source: Enter a valid duration.
id: Masukkan durasi yang valid.

source: The number of days must be between {min_days} and {max_days}.
id: Jumlah hari harus antara {min_days} dan {max_days}.

source: No file was submitted. Check the encoding type on the form.
id: Tidak ada file yang dikirimkan. Periksa tipe pengkodean pada formulir.

source: No file was submitted.
id: Tidak ada file yang dikirimkan.

source: The submitted file is empty.
id: File yang dikirimkan kosong.

source: Ensure this filename has at most %(max)d character (it has %(length)d).
id: Pastikan nama file ini memiliki paling banyak %(max)d karakter (saat ini %(length)d).

source: Please either submit a file or check the clear checkbox, not both.
id: Harap kirimkan file atau centang kotak hapus, bukan keduanya.

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
id: Unggah gambar yang valid. File yang Anda unggah bukan gambar atau gambar yang rusak.

source: Select a valid choice. %(value)s is not one of the available choices.
id: Pilih pilihan yang valid. %(value)s bukan salah satu pilihan yang tersedia.

source: Enter a list of values.
id: Masukkan daftar nilai.

source: Enter a complete value.
id: Masukkan nilai lengkap.

source: Enter a valid UUID.
id: Masukkan UUID yang valid.

source: Enter a valid JSON.
id: Masukkan JSON yang valid.

source: (Hidden field %(name)s) %(error)s
id: (Bidang tersembunyi %(name)s) %(error)s

source: ManagementForm data is missing or has been tampered with. Missing fields: %(field_names)s. You may need to file a bug report if the issue persists.
id: Data ManagementForm hilang atau telah dirusak. Bidang yang hilang: %(field_names)s. Anda mungkin perlu melaporkan bug jika masalah berlanjut.

source: Please submit at most %(num)d form.
id: Harap kirimkan paling banyak %(num)d formulir.

source: Please submit at least %(num)d form.
id: Harap kirimkan setidaknya %(num)d formulir.

source: Order
id: Urutan

source: Please correct the duplicate data for %(field)s.
id: Harap perbaiki data duplikat untuk %(field)s.

source: Please correct the duplicate data for %(field)s, which must be unique.
id: Harap perbaiki data duplikat untuk %(field)s, yang harus unik.

source: Please correct the duplicate data for %(field_name)s which must be unique for the %(lookup)s in %(date_field)s.
id: Harap perbaiki data duplikat untuk %(field_name)s yang harus unik untuk %(lookup)s dalam %(date_field)s.

source: Please correct the duplicate values below.
id: Harap perbaiki nilai duplikat di bawah ini.

source: The inline value did not match the parent instance.
id: Nilai inline tidak cocok dengan instansi induk.

source: Select a valid choice. That choice is not one of the available choices.
id: Pilih pilihan yang valid. Pilihan tersebut bukan salah satu pilihan yang tersedia.

source: Clear
id: Hapus

source: Currently
id: Saat ini

source: Change
id: Ubah

source: Unknown
id: Tidak Diketahui

source: Yes
id: Ya

source: yes,no,maybe
id: ya,tidak,mungkin

source: midnight
id: tengah malam

source: noon
id: siang

source: Saturday
id: Sabtu

source: Sunday
id: Minggu

source: Mon
id: Sen

source: Tue
id: Sel

source: Wed
id: Rab

source: Thu
id: Kam

source: Fri
id: Jum

source: Sat
id: Sab

source: Sun
id: Min

source: January
id: Januari

source: February
id: Februari

source: March
id: Maret

source: May
id: Mei

source: June
id: Juni

source: July
id: Juli

source: August
id: Agustus

source: October
id: Oktober

source: December
id: Desember

source: may
id: mei

source: aug
id: agu

source: oct
id: okt

source: dec
id: des

# abbrev. month
source: March
id: Mar.

# abbrev. month
source: April
id: Apr.

# abbrev. month
source: May
id: Mei

# abbrev. month
source: June
id: Jun.

# abbrev. month
source: July
id: Jul.

# abbrev. month
source: Aug.
id: Agu.

# abbrev. month
source: Sept.
id: Sep.

# abbrev. month
source: Oct.
id: Okt.

# abbrev. month
source: Dec.
id: Des.

# alt. month
source: January
id: Januari

# alt. month
source: February
id: Februari

# alt. month
source: March
id: Maret

# alt. month
source: May
id: Mei

# alt. month
source: June
id: Juni

# alt. month
source: July
id: Juli

# alt. month
source: August
id: Agustus

# alt. month
source: October
id: Oktober

# alt. month
source: December
id: Desember

source: This is not a valid IPv6 address.
id: Ini bukan alamat IPv6 yang valid.

source: or
id: atau

source: %(num)d year
id: %(num)d tahun

source: %(num)d month
id: %(num)d bulan

source: %(num)d week
id: %(num)d minggu

source: %(num)d day
id: %(num)d hari

source: %(num)d hour
id: %(num)d jam

source: %(num)d minute
id: %(num)d menit

source: Forbidden
id: Dilarang

source: CSRF verification failed. Request aborted.
id: Verifikasi CSRF gagal. Permintaan dibatalkan.

source: You are seeing this message because this site requires a CSRF cookie when submitting forms. This cookie is required for security reasons, to ensure that your browser is not being hijacked by third parties.
id: Anda melihat pesan ini karena situs ini membutuhkan cookie CSRF saat mengirimkan formulir. Cookie ini diperlukan untuk alasan keamanan, untuk memastikan bahwa browser Anda tidak dibajak oleh pihak ketiga.

source: More information is available with DEBUG=True.
id: Informasi lebih lanjut tersedia dengan DEBUG=True.

source: No year specified
id: Tidak ada tahun yang ditentukan

source: Date out of range
id: Tanggal di luar rentang

source: No month specified
id: Tidak ada bulan yang ditentukan

source: No day specified
id: Tidak ada hari yang ditentukan

source: No week specified
id: Tidak ada minggu yang ditentukan

source: No %(verbose_name_plural)s available
id: Tidak ada %(verbose_name_plural)s tersedia

source: Future %(verbose_name_plural)s not available because %(class_name)s.allow_future is False.
id: %(verbose_name_plural)s mendatang tidak tersedia karena %(class_name)s.allow_future adalah False.

source: No %(verbose_name)s found matching the query
id: Tidak ada %(verbose_name)s yang ditemukan sesuai dengan kueri

source: Invalid page (%(page_number)s): %(message)s
id: Halaman tidak valid (%(page_number)s): %(message)s

source: Directory indexes are not allowed here.
id: Indeks direktori tidak diizinkan di sini.

source: Index of %(directory)s
id: Indeks %(directory)s

source: The install worked successfully! Congratulations!
id: Instalasi berhasil! Selamat!

source: View <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">release notes</a> for Django %(version)s
id: Lihat <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">catatan rilis</a> untuk Django %(version)s

source: You are seeing this page because <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> is in your settings file and you have not configured any URLs.
id: Anda melihat halaman ini karena <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> ada di file pengaturan Anda dan Anda belum mengonfigurasi URL apa pun.

source: Django Documentation
id: Dokumentasi Django

source: Tutorial: A Polling App
id: Tutorial: Aplikasi Polling

source: Get started with Django
id: Memulai dengan Django

source: Django Community
id: Komunitas Django

source: Connect, get help, or contribute
id: Terhubung, dapatkan bantuan, atau berkontribusi
